:PROPERTIES:
:ID:       cced4f94-9c6d-42f5-b3b5-1cc43e5fd8b8
:END:
#+title: emacs notes

* Manipulating windows

Split current window:
- Horizontally with ~space w n~
- Vertically with ~space w v~

Resize window by COUNT:

- Increase height: ~COUNT space w +~
- Decrease height: ~COUNT space w -~
- Increase width: ~COUNT space w >~
- Decrease width: ~COUNT space w <~

* Subscript and superscripts
[[https://orgmode.org/manual/Subscripts-and-Superscripts.html][Emacs documentation 12.3 Subscripts and Superscripts]]

You can add subscripts and superscripts by typing:

- ~1^{2}~
- ~1_{2}~

NOTE: The default syntax for this is just ~1^2~ or ~1_2~,
which may cause formatting issues in day-to-day writing.

I suspect doom emacs switches this default to the much
clearer ~1^{2}~ and ~1_{2}~ syntax.

You can run ~org-toggle-pretty-entities~ to display rendered subscript/superscript.

However, it /does/ hide formatting errors, especially when
replacing the sub/superscripted characters. You'll need top
disable ~org-toggle-pretty-entities~ to find stray
characters.

* Create a new and isolated org-roam directory
[[https://www.orgroam.com/manual.html#How-do-I-have-more-than-one-Org_002droam-directory_003f][Org-roam manual: 18.1 How do I have more than one Org-roam directory?]]

You can create a new and isolated org-roam directory by:

1. Creating a new directory.
2. In the new directory, create a ~.dir-locals.el~ file,
   containing:

   #+BEGIN_SRC elisp
   ((nil . ((org-roam-directory . "/path/to/alt/org-roam-dir")
         (org-roam-db-location . "/path/to/alt/org-roam-dir/org-roam.db"))))
   #+END_SRC

   Note: Locations must be absolute paths.
3. Using emacs, navigate to that directory.
   Emacs should prompt you with the following:

   #+BEGIN_EXAMPLE
   The local variables list in /Users/zeddee/working/zeddee-repos/
   contains values that may not be safe (*).

   Do you want to apply it? You can type
   y  -- to apply the local variables list.
   n  -- to ignore the local variables list.
   !  -- to apply the local variables list, and permanently mark these
         values (*) as safe (in the future, they will be set automatically.)
   #+END_EXAMPLE

4. Type ~y~ to preview your settings.
5. Make sure you're in your new org-roam directory using
   dired (emacs may attempt to restore your previous
   org-roam session).

   Then try to run ~org-roam-node-find~. emacs should ask
   you if you want to use settings from .dir-locals.el
   again.

   If successful, entries from your other org-roam directories
   should not be visible.
6. Finally, run ~org-roam-node-find~ again just to invoke
   org-roam, and when emacs prompts you again, type ~!~
   to make your .dir-locals.el settings permanent for
   that directory.

* Write and preview graphviz diagrams in orgmode files


From: https://joy.pm/post/2017-09-17-a_graphviz_primer/

You can write a graphviz diagram in code blocks and have
them render when you evaluate them with ~C-c C-c~:

#+BEGIN_EXAMPLE orgmode
#+BEGIN_SRC dot :file my_output_file.png :cmdline -Kdot -Tpng
digraph G {
  my_start -> one_branch;
  my_start -> another_branch;
}
#+END_SRC
#+END_EXAMPLE


* Run Python code in org mode

You can run Python code contained within source blocks in
org files[fn:1].

First, make sure that ~org-babel~ is configured to read and
run Python code. I added the following to my
~.doom.d/config.el~ file:

#+BEGIN_SRC elisp
(org-babel-do-load-languages
 'org-babel-load-languages
 '((python . t)))
#+END_SRC

This allows you to invoke source blocks like the one below
with ~C-c C-c~:

#+BEGIN_SRC python :results output :exports both
out = [i for i in range(1,10)]
print(out)
#+END_SRC

#+RESULTS:
: [1, 2, 3, 4, 5, 6, 7, 8, 9]


[fn:1] https://orgmode.org/worg/org-contrib/babel/languages/ob-doc-python.html
